package JavaTeamProject.Datas;

import JavaTeamProject.CustomComponent.CustomImage;
import JavaTeamProject.Model.Location;
import JavaTeamProject.Model.Pin;

import java.awt.*;

public class SchoolDatas extends Datas{
    public Pin[] pins = new Pin[]{
            new Pin(new Location(482, 485), "승연관", "images/TeamProject/senongyeon.jpg", "<html>승연관(건물번호 1번 건물분류기호는 A)-대학본부.<br>"
                    + "학교 중앙에 위치하고 있으머 대학본부의 역할을 한다.<br>"
                    + "1층은 총무처 예비군대대 등이 있으며 2층은 교무처 입학홍보처,나눔융합전공대학학생상담센터 등이 있다.<br>"
                    + "3층은 총장실 부총장실 기획처 등이 있으며<br>"
                    + "4층과 5층은 강의실,대학원공동연구실이 있다<br>"
                    + "'승연관'이라는 이름의 유래는 한화그룹의 '김승연' 회장의 이름을 따서 지은 것이다. 김승연 회장과 그 일가는 독실한 성공회 신자로 유명하다.</html>"),

            new Pin(new Location(528, 471), "일만관", "images/TeamProject/ilman.jpg", "<html>일만관(건물번호 2번 건물분류기호는 B)<br>"
                    + "승연관 뒷쪽에 위치하고 있으며 각종 학내 연구소 등이 존재한다. 또한 여학우 쉼터 '여우터' 도 존재한다.<br>"
                    + "1층에는 원래 다목적 카페가 있었지만 현재는 지역 주민들도 이용할 수 있는 컴퓨터실습실이 되었다<br>"
                    + "2층에는  정보통신연구소 사회적기업연구센터 등 학내 연구소가 위치한다.<br>"
                    + "3~4층도 마찬가지로 HK교수연구실 노동사연구소 민주주의연구소 등 연구소와 공용세미나실이 존재한다.<br>"
                    + "5층에는 대형 강의실이 존재한다.<br>"
                    + "참고로 일만관에는 엘레베이터가 존재하지 않는다. 몸이 불편한 학우는 일만관 이용이 타 학우보다 힘들다.</html>"),

            new Pin(new Location(511, 531), "월당관", "images/TeamProject/wordang.jpg", "<html>월당관(건물번호 3 건물분류기호 C).<br>"
                    + "미가엘관 앞에 있는 건물로 건물 모양이 좌우로 좁고 앞뒤로 길죽한 모양이다.<br>"
                    + "이재정 석좌교수(전 경기도교육감)의 장인이 돌아가신 후 기부한 유산으로 지어졌다 장인의 호가 '월당' 이여서 월당관으로 이름이 지어졌다<br>"
                    + "1층에는 수업지원팀 AS센터등이 있다. 학기 초에 노트북이나 기자재 대여를 원하면 이곳에서 빌려가면 된다.<br>"
                    + "2층에는 열람실이 존재하며 콘센트가 구비되어 있는 노트북 열람실(제 1열람실)과 파티션이 있는 집중 열람실(제 2열람실)이 존재한다.<br>"
                    + "3층부터 5층은 강의실이 존재한다 참고로 월당관에도 엘레베이터는 존재하지 않는다 몸이 불편한 학우는 월당관 이용이 어렵다.</html>"),

            new Pin(new Location(368, 461), "나눔관", "images/TeamProject/nanum.jpg", "<html>나눔관(건물번호 5 건물분류기호 EC or 5C)-학생회관<br>"
                    + "학생회관의 역할을 수행하고 있는 건물이다<br>"
                    + "원래는 1974년에 개교한 성 베드로 학교의 건물이었으나 운동장 뒷편 신축건물로 이전하면서 강의실로 쓰였다가 미가엘관 신축 후 학생회관으로 개편되었다<br>"
                    + "대부분의 학생은 '나눔관'이라는 명칭을 잘 모른다. 학관,과방건물로 많이 부른다<br>"
                    + "학생회실 동아리실 학생인권위원회 각 전공 과방 등이 존재한다 또한 학우들이 자주 이용하는 학내 카페 자연드림도 이곳에 위치하고 있다<br>"
                    + "이곳에는 남학생 쉼터 즉 '남우터'도 설치되어 있다. </html>"),

            new Pin(new Location(582, 536), "이천환기념관", "images/TeamProject/information.jpg", "<html>이천환기념관(정보과학관, 건물번호 6 건물분류기호 F)<br>"
                    + "성공회대의 이공계 수업 대부분은 이 건물에서 이루어진다 1층은 주로 컴퓨터공학전공 학생들이 사용하는 실습실과 프로젝트실 미디어 센터가 있다.<br>"
                    + "2층에는 주로 소프트웨어공학전공 학생들이 주로 이용하는 실습실과 전자계산소가 존재한다.<br>"
                    + "3층은 이공계 교수님들의 연구실이 있고 4층은 주로 정보통신공학전공과 디컨전공 학생들이 주로 사용하는 실습실이 존재한다.<br>"
                    + "5층은 강당이며 '존 데일리 홀'이라고도 불린다 성공회대에서 가장 수용인원이 큰 공간이다.<br>"
                    + "6층은 음악원이며 가끔 이공계 실습실에서 수업 도중에 들려오는 정체불명의 음악,노래소리는 대부분 이 곳에서 들리는 것이다.<br>"
                    + "입구가 여러 곳에 있는데 1층 입구는 행복기숙사,운동장 방면으로 나와 있고 2층 입구는 미가엘관과 월당관 쪽에 나와 있다. 3층 입구는 미가엘관 3층과 다리로 이어져 있다.</html>"),

            new Pin(new Location(431, 359), "새천년관", "images/TeamProject/newthousand.jpg", "<html>성공회대 대부분의 인문사회계열 수업이 이 곳에서 이루어지며 상당히 많은 수의 교양 수업도 이 곳에서 이루어진다.<br>"
                    + "우리의 점심,저녁을 책임지는 학식과 편의점(이마트 24)도 이 곳에 위치하고 있다.<br>"
                    + "지하 1층에는 학식(국수나무) 가 존재하며 우동 돈까스 제육덮밥 순대국 우동 등 다양한 메뉴의 학식이 존재한다<br>"
                    + "가격은 4500원에서 7500원까지 다양하다. 또한 이마트 24도 지하 1층에 위치해 있다.<br>"
                    + "1층에는 잡카페 컴퓨터실 언론메체실 등이 있다 또한 사회진출지원센터 학생복지처 건강증진센터 등 학생복지시설도 이 곳에 위치하고 있으며 아직 전공 진입을 못한 학부생들의 학부방도 이 곳에 위치하고 있다.<br>"
                    + "2~3층은 강의실로 사용되고 있으며 4~7층은 인문사회계열 교수님들의 연구실로 사용되고 있다.</html>"),

            new Pin(new Location(487, 377), "중앙도서관", "images/TeamProject/mainLib.jpg", "<html>중앙도서관(8)<br>"
                    + "지하 1층~지상 4층 규모이며 원래는 아니였지만 현재는 전 좌석 지정좌석제로 운영되고 있다<br>"
                    + "지하 1층에는 컴퓨터 철학 종교 성공회컬렉션 등의 도서 자료가 비치되어 있다 또한 열람 좌석이 존재한다<br>"
                    + "1층에는 세미나실 아시아+존,카페 아시아,그룹스터디룸 등이 있다<br>"
                    + "2층에는 시네마 스페이스와 멀티미디어 존이 있다 이 곳에서 빌린 DVD는 옆 시네마 스페이스 에서 감상할 수도 있다<br>"
                    + "3층에는공부를 할 수 있는 열람 좌석이 존재하고도서 자료로는 어학 사회과학 순수과학 기술과학 등이 있다<br>"
                    + "4층에는 예술 문학 역사의 도서 자료들이 비치되어 있고 열람 좌석이 있다<br>"
                    + "참고로 이 곳은 응팔(응답하라 1988)의 배우 류혜영씨가 와서 촬영한 장소이기도 하다.</html>"),

            new Pin(new Location(499, 413), "피츠버그 홀", "images/TeamProject/pitz.jpg", "<html>성 미가엘 성당,피츠버그 홀(건물번호 9 건물분류기호 I)<br>"
                    + "교목실과 성당으로 구성되어 있다. 채플수업,종교행사 떄 이용한다 <br>"
                    + "피츠버그홀의 이름은 1998년 캠퍼스 현대화가 되기 전 현 위치에 '피츠버그 교구'에서 재정지원을 받아 건축한 강당 이름이 '피츠버그 홀'이었기 때문이다.</html>"),

            new Pin(new Location(378, 335), "구두인관", "images/TeamProject/guduin.jpg", "<html>구두인관(10)<br>"
                    + "학교 정문 바로 옆에 있는 건물로 법인사무국 인문학습원 평생학습연구소 신학연구원 구로마을대학 등으로 구성되어 있다.<br>"
                    + "이 건물은 유한양행 창업주이자 옆 유한공고와 유한대학교 설립자인 유일한 회장의 사저로 유일한 회장이 죽기 전까지 살았던 곳이다.후에 성공회대가 인수하였다.</html>"),
            new Pin(new Location(577, 495), "미가엘관", "images/TeamProject/micael.jpg", "<html>미가엘관(건물번호 11 건물분류기호 M)<br>"
                    + "학교에서 나름 최신 건물에 속하는 곳으로(2010년대 준공) 1층에는 과거 '깐투치오'라고 불렸고 지금은 '밥풀' 이 된 학식과 학내 헬스시설 멋GYM이 있다<br>"
                    + "2층에는 대형 강의실과 소규모 강의실이 있고 사감실 및 행정실이 있다<br>"
                    + "3층에는 이제라홀이라고 불리는 대형 강의실 하나가 있고 이천환기념관 3층과 이어지는 다리와 작은 정원이 있다<br>"
                    + "이 다리와 정원 사이는 흡연구역이다<br>"
                    + "4층에는 컴퓨터실습실과 일반 강의실이 있으며 5층부터 7층까지는 기숙사이다</html>"),
            new Pin(new Location(462, 631), "성베드로학교", "images/TeamProject/stpeter.jpg", "<html>성베드로학교(12)<br>"
                    + "우리 학교와 붙어있는 특수학교로 간혹 저 건물도 캠퍼스냐고 묻는 학우들도 있지만 학교 캠퍼스가 아닌 별개의 학교이다.<br>"
                    + "평시에는 가볼일이 별로 없으나 사회봉사나 교내근로 등을 할 때 이 곳에서 근무하는 경우도 있다.</html>"),
            new Pin(new Location(577, 607), "행복기숙사", "images/TeamProject/domitory.jpeg", "<html>행복기숙사 더 숲(13)<br>"
                    + "2019년초 개관했다 지하 1층 ~ 지상 10층 규모로 회대 재학생 졸업생 뿐만 아니라 유한대 재학생도 사용이 가능하다<br>"
                    + "기숙사생이 아니면 출입이 불가능하며 보통 2인 1실을 사용한다<br>"
                    + "지하 1층엔 취사공간과 세탁실 세미나실이 있다.</html>"),
    };

    public void initPins(Container container) {
        for (Pin pin: pins) {
            CustomImage image =
                    new CustomImage(pin.location.x, pin.location.y, 24, 24, "images/TeamProject/pin.png")
                            .visible(false);

            pinImages.add(image);
            setMouseListener(image, pin);
            container.add(image);
        }
    }
}
